# 记录一次几乎是错误方向的虚拟机网路排查

## 背景

朋友搞了个刀片机，我给他做了个小项目，之后打算刀片机虚拟一个windows我没事远程连接，之后通过这个机器连接真正的服务器实例来相对保证安全，这个w10之前成功开机过且下载好了软件。
这次给我用的时候，右下角网络显示正常，但是打不开任何页面，显示connection reset,这我可就不困了，我就开始折腾了起来。。

# 开始折腾

## 关卡1：
首先电脑识别网络是通的，页面不行，先来一套ping+curl baidu.com压压惊，结果挺有意思的，全是失败，本来一开始目标是DNS的，这么看像是网络配置有关系，遂去exsi检查了下网卡和交换机配置，胡乱操作一顿将vswitch的上行链路修改了下，原来配置了2个，第一是未连接，第二是已连接的端口，删除了第一个后返回检查，ping和curl都能正常返回，以为修好了，结果页面打开还是reset。。。

## 关卡2：
行吧，这时候首先curl baidu.com可以返回具体内容，说明DNS是ok的，但是为什么页面不显示，一开始怀疑方向是网络异常断开，找了点资料，怀疑是MTU设置问题，期间询问ai修改了MTU到1400甚至1280，还是没什么效果。AI提供的ping测试命令的确在报错说包过大需要分DF,所以一直怀疑MTU折腾了半天。

## 关卡3：
折腾一阵后我用curl-kv做了一次测试时候意外发现，结果在提示TLS/SSL握手失败，突然意识到可能并不是MTU的问题，遂把MTU值恢复1500，开始调查TLS握手相关可能，此时命令首先提示的是由于**吊销服务器以脱机，吊销功能无法检查**。属实是第一次遇到这个报错，遂关闭了强制吊销检查，这时候又发现是这个虚拟机的时间的确有问题，于是将时间改为好，并且设置自动与时间服务器同步，但是没啥用。

## 关卡4：
继续折腾，现在稳定提示TLS/SSL握手失败，开始询问AI，给出了一大堆花里胡哨的解决方案，如curl的时候强制TLS1.2认证，关闭一些强制安全认证等。AI一股信誓旦旦表示这次配置后一定搞定，但是每次结束后都失望而归，AI甚至怀疑是windows的schannel有问题，建议我找一个linux试试，不过这个的确提醒我应该检查是这个虚拟机还是整个exsi都有问题，遂打开隔壁一个debian系统，发现顺利curl通了https的百度，非常丝滑，这时候可以判断应该是这个W10的问题，但是还是不理解为什么。。

## 存档，准备放弃：

折腾到这基本已经是词穷了，这时候损友表示要再服务器再插一根网线，按照经验来说这没有任何用途，不过查完后我顺手把vswitch的配置恢复成我折腾之前的配置，即2个不同上行链路。之后突然发现网络通了。。。当时怀疑是某个网口有问题，遂分别关闭网口并测试网络，但是非常见鬼，不管关闭哪一个网络都必死，只有2个同时开才好用，当时满脑子都怀疑这服务器是搞什么高端操作？灾备线路？但是说不通呀，但是折腾了一上午实在太费脑子了，遂作罢。

## 继续存档，意外收获：
次日，本来目的是用win10部署项目，于是正常连接部署一气呵成，这地方遇到个很奇怪的问题先记录一下：
我build好了一个docker iamges，enterypoint指向了一个sh，权限可能是511，在本地docker start后是正常启动的，不知道为什么save load到他服务器后docker start报错1.sh没有权限，但是按理说docker不应该这个错误，有时间会调查下。。

回到正题，折腾差不多时候损友启动了另一台虚拟机，之后我的虚拟机网络瞬间暴毙，但是当他关闭机器后一切都正常了，突然怀疑是不是IP冲突了，损友也表示另一台服务器是克隆出来的，昨天实际上已经怀疑这个问题但是因为2个服务器都是DHCP理论上不应该出现这个问题所以没有细查。尤其是当插上2根网线好了后更是丧失调查的勇气。 不过今天突然意识到这时候应该是mac记录，怀疑是克隆时候mac一致，dhcp识别同一个mac遂分配同一ip， ipconfig一下果然同一ip， ipconfig /all 一下，果然相同mac。。这下真相大白。。

## 小结与疑问：
虽然最终解决了问题，但是还是有点被经验主义误导，因为之前遇到过如果局域网有IP冲突windows会自动识别并提示，但是没想到mzc一致时内网认为是正常的所以没提示这个问题，不过还是有个很奇怪的问题：
**为什么之前插2根网线时候，网络通了。。？**

记一下 有时间回来调查下。。
